/*********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  calibratecmd.c；
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2016.12.15;
历史版本:  无;
*********************************************************************************************/
#include <string.h>
#include "calibratecmd.h"
#include "cmdparse.h"



/****************************************外部变量声明*****************************************/



/*****************************************局部宏定义******************************************/



/*************************************局部常量和类型定义**************************************/



/******************************************局部变量*******************************************/
SubCmdProFunc pCalibrateCmdFunc[CALBRCMD_RESERVE];



/******************************************函数实现*******************************************/
/*********************************************************************************************
函 数 名: CalibrateBackLash;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateBackLash(u8 cmdDataLen, u8 *pCmdData)
{    

}

/*********************************************************************************************
函 数 名: CalibrateBackLashEnd;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateBackLashEnd(u8 cmdDataLen, u8 *pCmdData)
{    

}


/*********************************************************************************************
函 数 名: CalibrateMechError;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateMechError(u8 cmdDataLen, u8 *pCmdData)
{    

}

/*********************************************************************************************
函 数 名: CalibrateMechErrorEnd;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateMechErrorEnd(u8 cmdDataLen, u8 *pCmdData)
{    

}


/*********************************************************************************************
函 数 名: CalibrateCmdInit;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateCmdInit(void)
{
    memset(pCalibrateCmdFunc, 0, sizeof(pCalibrateCmdFunc));

    pCalibrateCmdFunc[CALBRCMD_BACKLASH]  = CalibrateBackLash;
    pCalibrateCmdFunc[CALBRCMD_BLEND]     = CalibrateBackLashEnd;
    pCalibrateCmdFunc[CALBRCMD_MECHERROR] = CalibrateMechError;
    pCalibrateCmdFunc[CALBRCMD_MEEND]     = CalibrateMechErrorEnd;
}

            
/*********************************************************************************************
函 数 名: CalibrateCmdProc;
实现功能: 无; 
输入参数: 无;
输出参数: 无;
返 回 值: 无;
说    明: 无;
*********************************************************************************************/
void CalibrateCmdProc(CmdParseFrameStr *pCmdStackFrame)
{    
    u8 dataLen = pCmdStackFrame->dataLen;
    u8 *pData = pCmdStackFrame->payload;

    
    if ((pCmdStackFrame->subType < CALBRCMD_RESERVE) && (pCalibrateCmdFunc[pCmdStackFrame->subType] != NULL))
    {    
        pCalibrateCmdFunc[pCmdStackFrame->subType](dataLen, pData);
    }
}



/*******************************************文件尾********************************************/