/*********************************************************************************************
Copyright (C) 2016，北京镁伽机器人科技有限公司
文 件 名:  protocolstack.h;
功能描述:  ;
函数列表:  ;
当前版本:  1.0.0;
版本改动:  ;
作    者:  CJ;
完成日期:  2016.11.16;
历史版本:  无;
*********************************************************************************************/
#ifndef __PROTOCOL_STACK_H
#define __PROTOCOL_STACK_H



/******************************************包含文件*******************************************/
#include "stm32f10x.h"
#include "datatype.h"
#include "debug.h"
#include "usartmac.h"
#include "canmac.h"
#include "cmdparse.h"



/****************************************外部变量声明*****************************************/



/*******************************************宏定义********************************************/



/***************************************常数和类型声明****************************************/
typedef void (*CmdParseFunc)(CmdParseFrameStr *pCmdStackFrame);
typedef void (*SubCmdProFunc)(u8 cmdDataLen, u8 *pCmdData);



/******************************************变量声明*******************************************/



/******************************************函数声明*******************************************/
void ProtocolStackInit(void);
void CmdParseFrameRegister(CmdTypeEnum msgType, CmdParseFunc pFunc);
void CmdParseFrameProcess(void);



/*****************************************头文件保护******************************************/
#endif
/*******************************************文件尾********************************************/
